#Слот второго дня.

label day_2_slot_dv:
    scene bg ext_beach_sunset
    with dissolve
    "Я так давно хотел попасть на пляж!"
    "Но безумный день закрутил меня в круговороте своих невозможных событий."
    "Сначала я был занят с обходным листком... {w=.3}который и вовсе не пригодился."
    "Но я все же не без удовольствия вспомнил, как познакомился с оставшимися обитателями лагеря..."
    "Но это было утром."
    th "Я ведь так еще и не записался в музыкальный клуб..."
    "А после обеда столько всего произошло, что о пляже некогда было и вспоминать!"
    "Но все закончилось... {w=.3}надеюсь."
    th "Я ведь победил в турнире! Самое время расслабиться и отпраздновать!"
    "И я наконец смог, пусть и под самый вечер, выбраться на берег..."
    "Не знаю, была ли это река или море, но другой берег терялся в синеве неба и воды."
    "Я всмотрелся вдаль."
    "Железная дорога причудливой нитью проходила на фоне безупречного неба."
    "Переливаясь, волны слепили, так что приходилось щуриться."
    "Солнце медленно скатывалось за горизонт, окрашивая низкие облака во все оттенки розового, лилового и оранжевого."
    "Словно ребенок, играющий с красками..."
    "Но хоть солнце и уходило, объявляя приближающийся конец дня, все еще было тепло."
    "Даже жарко."
    "И очень хотелось прыгнуть с разбегу в воду и растянуться на волнах, отдыхая от суеты и всяческих волнений."
    "Я сбросил кеды."
    "Какое же это блаженство - чувствовать, как янтарный песок пересыпается под пальцами, хрустит и покалывает пятки маленькими камушками!"
    "За день солнце нагрело его так, что и сейчас еще он приятно обжигал голую кожу!"
    "Я расстегнул рубашку, сунув надоевший уже галстук в карман."
    "И невольно обернулся, прежде чем стянуть шорты."
    "Плавок у меня с собой не было, так что купаться придется в семейниках..."
    "Слава богу, я не одел перед прогулкой те, что купила мать - в цветочек..."
    "Но вокруг не было никого, и пляж сейчас принадлежал только мне!"
    "Я бросил одежду на песок и разбежавшись врезался в воду!"
    "Как же давно я не плавал!"
    scene bg ext_beach_day
    with dissolve
    "Даже рядом с берегом тут было довольно глубоко."

    #"TODO: Зум к воде!"

    "Я плыл на спине, слушая убаюкивающий плеск воды, и думал о том, как хорошо все-таки ни о чем не думать..."
    "И только я понял, что шум изменился, как кто-то резко дернул меня за ногу..."
    "И расхохотался!"

    play sound sfx_underwater_dive

    #"TODO: ВСПЛЕСК - ЗВУК!"

    "От неожиданности я с головой ушел под воду."
    "Я успел только заметить чьи-то явно девичьи ноги и оранжевый купальник..."
    "Под водой смех казался еще более обидным..."
    "А когда вынырнул, она уже вовсю гребла в сторону открытого моря, успев весело крикнуть!"
    dv_voice "Догоняй!"
    "Голос был знакомый, но..."
    dv_voice "Кто первый до буйков?"
    "И моя обида разом уступила место азарту!"
    "Я бросился догонять!"
    "................................"

    scene cg d2_water_dan
    with dissolve
    #"TODO: Сделать вариацию фона с Семеном на буйке - БЕЗ Алисы."

    "Не знаю, откуда взялись во мне силы после такого дня, но у буйка я оказался первым..."
    "Тяжело дыша и не в силах больше держаться на воде, я вскарабкался на плавучий бакен..."
    "И только тогда понял, насколько далеко я от берега..."
    "Отсюда он казался тонкой линией."
    th "Как же я поплыву обратно?!"

    scene cg d2_water_dan
    with dissolve

    "И почти сразу же ко мне подплыла Алиса..."
    "Вскочив из воды она звонко шлепнула меня по плечу."
    "Так вот с кем мы соревновались..."
    th "Опять..."
    "Она тоже тяжело дышала после нашего рывка..."
    "Но она и не думала издеваться!"
    "А только улыбнулась."
    "И в этой улыбке не было ничего угрожающего или обидного."
    dv "Опять ты меня обыграл."
    dv "Поздравляю."
    "Я только кивнул, не ожидая такого от Алисы..."
    "А она снова улыбнулась."
    dv "Ну, что вцепился?"
    dv "Поплыли обратно?"

    #"TODO: Зум обычного фона с момента у воды - до пляжа."
    "И мы, даже не отдохнув, поплыли к берегу, но теперь уже не на перегонки"

    "................................"

    scene bg ext_beach_sunset
    with dissolve

    "Едва ступив на пляж, мы не раздумывая бросились на песок."
    "Мы оба тяжело дышали, а я понемногу приходил в себя."
    "Когда я в последний раз столько плавал?"
    "Я раскинул руки в стороны и отдыхал."
    "Наконец я смог поднять голову - посмотреть, где был тот буек, до которого мы доплыли..."
    "Ничего себе!"
    "Кажется, мы поставили рекорд..."
    "Если не по скорости, то по дистанции точно..."
    "Я взглянул на Алису."

    scene cg d2_2ch_beach
    with dissolve

    "А она..."
    "Она уже стояла на ногах, как будто и не было только что нашего заплыва!"
    "Стояла в лучах закатного солнца, держа руками резиновый круг, обвивший ее ноги, и пристально смотрела на меня..."
    th "Как это ее волосы так быстро высохли?"
    "Но не это привлекло мое внимание."
    "А ее открытая спина с завязками, подкрашенная вечерним светом."
    "Влажный купальник явно очерчивал ее грудь..."
    "А капли воды блестели на руках и под коленками..."

    scene bg ext_beach_day
    with dissolve
    "Я судорожно сел, прикрыв руками свои семейники..."
    "Но она, казалось, ничего и не заметила..."

    $ dv_dress = 'swim'
    show dv std

    dv "А ты не такой и слабак."
    "И в ее устах это было, наверное, самым настоящим комплиментом."
    "Она прищурилась и снова улыбнулась."
    dv "Мы с тобой еще посоревнуемся!"
    hide dv
    $ dv_dress = 'pioneer'
    "И она легко пошла по песку туда, где лежала холмиком ее сброшенная на песок форма."
    "А я снова упал на спину, уже совсем без сил..."
    "Что за день сегодня!"

    "................................"

    jump day_2_dream