#Слот второго дня.

label day_2_slot_sl:
    scene bg ext_no_bus_sunset
    with dissolve
    $ renpy.music.set_volume (0.6, channel=7)
    play music music_list["dance_of_fireflies"] channel 7
    "Замечтавшись, я не сразу заметил Славю, которая прошла совсем рядом со мной."
    "Но я стоял за постаментом, и поэтому она меня не увидела."
    "Я уже хотел окрикнуть ее..."
    "Но она вдруг свернула вправо и скрылась за деревьями."
    th "Странно! Разве пионерам разрешается покидать лагерь?"
    "Мне стало интересно, куда пошла Славя, да еще под самый вечер, и я пошел за ней."
    scene bg ext_path_sunset
    with dissolve
    "Мы шли по хорошо утоптанной тропе."
    "Славя, а чуть позади я."
    "Я старался не приближаться к ней близко и двигаться аккуратно, но и не прятался."
    "Так что если бы она обернулась, то обязательно заметила бы меня."
    "Но она не оборачивалась."
    "Мы шли довольно долго, и я даже подумал, что она хочет убежать из лагеря..."
    "Но вряд ли бы она стала это делать."
    "Я все еще помнил ее слова о том, как ей нравится здесь."
    "Тем интереснее было узнать, куда она идет."
    scene bg ext_path_night
    with dissolve
    "Время шло, вокруг уже заметно стемнело..."
    "А мы все еще брели по запутанной тропе."
    "Пару раз я хотел уже окликнуть Славю, но каждый раз что-то останавливало меня."
    "Ведь мы уже довольно далеко зашли..."
    "Настолько далеко, что я уже всерьез подумывал о том, чтобы развернуться и пойти обратно..."
    "Но тут Славя вдруг остановилась..."
    "Мы стояли сейчас у едва заметного ответвления тропинки."
    "И я бы даже не узнал о нем, если бы не Славя, которая свернула в чащу леса."
    "А она вдруг как-то изменилась..."
    "Ее движения замедлились и стали еще плавнее и грациознее."
    "Теперь она словно плыла сквозь заросли высокой травы."
    "Сам не зная - почему, но я уже не старался идти открыто, а брел чуть позади за деревьями..."
    scene cg d2_slavya_forest
    with dissolve
    "А каждый шаг Слави делался все более танцевальным..."
    "И я уже просто не хотел разрушить гармонию момента."
    "Славя была сейчас частью природы..."
    "Вокруг нее кружились налетевшие со всех сторон светлячки."
    "Мягкая трава обнимала нежно ее длинные ноги..."
    "Славя закрыла глаза и полностью отдалась власти танца..."
    "Она расстегнула рубашку и сбросила мешавший ей галстук на траву..."
    "Ее косы струились в прохладном воздухе..."
    "И я жадно ловил этот момент, стараясь запомнить все увиденное, потому что для меня это было впервые."
    "Я был свидетелем чего-то первобытного и по-своему прекрасного..."
    scene bg ext_path_night
    with dissolve
    "А потом все кончилось, и я оказался на том самом месте, где Славя свернула в лес."
    "Самой ее нигде не было видно."
    "Я не знал, что мне делать."
    "Искать Славю?"
    "Но было уже темно, и самым вероятным было бы потеряться самому."
    "Славя же наверняка знала дорогу домой."
    "Так что я, еще немного постояв возле развилки, с непонятным щемящим чувством в груди пошел обратно в лагерь..."
    jump day_2_dream